In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {'name':['alamin','fatema','tania','mim'],
        'age':[22,21,22,20],
        'city':['dhaka','comilla','itali','sylet']}
data

{'name': ['alamin', 'fatema', 'tania', 'mim'],
 'age': [22, 21, 22, 20],
 'city': ['dhaka', 'comilla', 'itali', 'sylet']}

In [4]:
type(data)

dict

In [5]:
df = pd.DataFrame(data=data)
df

     name  age     city
0  alamin   22    dhaka
1  fatema   21  comilla
2   tania   22    itali
3     mim   20    sylet

In [6]:
df['name']

0    alamin
1    fatema
2     tania
3       mim
Name: name, dtype: object

In [7]:
df.name

0    alamin
1    fatema
2     tania
3       mim
Name: name, dtype: object

In [8]:
df[['name']]

     name
0  alamin
1  fatema
2   tania
3     mim

In [9]:
df

     name  age     city
0  alamin   22    dhaka
1  fatema   21  comilla
2   tania   22    itali
3     mim   20    sylet

In [10]:
# del df['city']
# df

In [11]:
# df.pop('age')
# df

In [12]:
df

     name  age     city
0  alamin   22    dhaka
1  fatema   21  comilla
2   tania   22    itali
3     mim   20    sylet

In [13]:
newdata = ['black','red','green','orange']
df.insert(loc=3,column="fav_color",value=newdata)
df

     name  age     city fav_color
0  alamin   22    dhaka     black
1  fatema   21  comilla       red
2   tania   22    itali     green
3     mim   20    sylet    orange

In [14]:
df[1:]

     name  age     city fav_color
1  fatema   21  comilla       red
2   tania   22    itali     green
3     mim   20    sylet    orange

In [15]:
df.loc[[1,3],['age','fav_color']]

   age fav_color
1   21       red
3   20    orange

In [16]:
df

     name  age     city fav_color
0  alamin   22    dhaka     black
1  fatema   21  comilla       red
2   tania   22    itali     green
3     mim   20    sylet    orange

In [18]:
df.describe()

             age
count   4.000000
mean   21.250000
std     0.957427
min    20.000000
25%    20.750000
50%    21.500000
75%    22.000000
max    22.000000